# Curve Overlap Point First Parameter Property

Source: https://www.revitapidocs.com/2026/3e511a9a-e240-bb01-09e2-0cc340ad8f7e.htm

---

| Curve Overlap Point First Parameter Property |
| --- |

The point's unnormalized parameter on the first curve.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double FirstParameter { get; }
```

```
Public ReadOnly Property FirstParameter As Double
	Get
```

```
public:
property double FirstParameter {
	double get ();
}
```

```
member FirstParameter : float with get
```

#### Property Value

Double See Also

#### Reference

CurveOverlapPoint Class Autodesk.Revit.DB Namespace